int/resources/objectRepo/xmlTemplates/opera/Reservation/req_CreateGuestMessages.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/rsv/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:CreateGuestMessagesRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v91:ReservationIDList>
            <v91:UniqueID ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
         </v91:ReservationIDList>
         <v9:HotelCode/>
         <v9:GuestMessages>
            <v91:GuestMessage CreateDateTime="?" CreatorID="?" ID="?" IDExtension="?" ID_Context="?" Instance="?" LastModifierID="?" LastModifyDateTime="?" PurgeDate="?" Type="?" URL="?">
               <v91:Message MessageDate="?" Operator="?" Recipient="?" TypeOfMessage="?">
                  <v91:MessageText/>
               </v91:Message>
               <v91:Delivery DeliveredBy="?" DeliveryDate="?" DeliveryStatus="?" PrintDate="?" TextMessageRecipientNo="?" TextMessageSentBy="?" TextMessageSentById="?" TextMessageSentDate="?"/>
            </v91:GuestMessage>
         </v9:GuestMessages>
      </v9:CreateGuestMessagesRQ>
   </soapenv:Body>
</soapenv:Envelope>